Repository: wp-plugins/wp-seo-title
Catalog: languages/wp-seo-title-*.po
Languages: es_es

source: Get Suggestions
es_es: Mostrar Sugerencias

source: Suggestions for titles
es_es: Sugerencias para títulos

source: Put Keyword
es_es: Introduce Palabra clave

source: Suggestions for
es_es: Sugerencias para

source: Please enter a keyword in title or keyword input and try again.
es_es: Por favor, introduzca una palabra clave en el título o palabra clave de entrada y vuelva a intentarlo.

source: WP SEO Title Options
es_es: Opciones de WP SEO Title

source: Country
es_es: País

source: Select the Country that is used for Google requests.
es_es: Selecciona el país del que provienen principalmente tus usuarios.

source: Update List Countries
es_es: Actualiza la lista de paises

source: Value
es_es: Valor

source: Volume
es_es: Volumen

source: Profit
es_es: Rentabilidad

source: Option to order
es_es: Opción para ordenar

source: Order
es_es: Orden

source: DESC: for a descending sort. ASC: for a ascending sort
es_es: DESC: orden descendiente. ASC: orden ascendente.

source: Save Changes
es_es: Guardar cambios

source: Keyword
es_es: Palabra clave

source: Keyword: key phrase.
es_es: Keyword: Palabra Clave.

source: Credits
es_es: Creditos

source: Volume: search popularity for the keyword each months.
es_es: Volumen: popularidad de esta keyword de búsqueda promedio en cada mes.

source: CPC: cost per click.
es_es: CPC: coste por click.

source: Profit: good keyword
es_es: Rentabilidad: buena palabra clave.

source: Set as title
es_es: Poner como título

source: More suggestions
es_es: Más sugerencias

source: Check existing
es_es: Comprobar existentes
